//
// 🖼 Домашнее задание: Создание метода для работы с массивом
// 🔹 Задание
// Создайте функцию replaceLastElement, которая принимает два параметра: массив и строку и заменяет последний элемент в массиве на указанную строку.

// Функция не должна ничего возвращать.
const arrName = ["V", "L", "A", "D"];
const str = "T";

const replaceLastElement = (arr, st) => {
  if (arr.length === 0) {
    console.log("ERROR - arrays is empty");
    return;
  }
  arr[arr.length - 1] = st;
};

replaceLastElement(arrName, str);
